Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPerTreadFamilyId
The id of baluster per tread family.
Remarks:
The property defines a baluster family type which is used for creation of balusters on treads.
The number of such balusters is set by "BalusterPerTreadNumber" property.
It works only for stairs which have treads and have "UseBalusterPerTreadOnStairs" set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The balusterPerTreadFamilyId doesn't refer to a valid baluster family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019